In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
data = Series(['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [4]:
data.isnull() # find a null value in a series

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
data.dropna() #drop a null value

0     one
1     two
3    four
dtype: object

In [10]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [13]:
clean_dframe = dframe.dropna()
clean_dframe
# dropna will drop any row with null value

     0    1    2
0  1.0  2.0  3.0

In [14]:
dframe.dropna(how = 'all')
# drops a row that has all of the null values

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [15]:
dframe.dropna(axis = 1)
# every column has a null value so it drops everything.

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [16]:
npn = np.nan

dframe2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [17]:
dframe2.dropna(thresh = 2)
# drop rows with minimam 2 data points

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [18]:
dframe2.dropna(thresh = 3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [19]:
dframe.fillna(1) # fill a null value with 1

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0

In [24]:
dframe2.fillna({0:"A",1:"B",2:"C",3:"D"})
# .fillna({column number:what you want python to fill with})

     0    1    2    3
0  1.0  2.0  3.0    D
1  2.0    B  5.0  6.0
2    A  7.0    C  9.0
3  1.0    B    C    D

In [28]:
dframe2.fillna(0,inplace = True)
# modifies existing objects permanently

In [29]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0